# Delete rows with missing values

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('empleados.csv', delimiter=";")

In [3]:
print(df.head(20))

       Nombre       Sexo   Estado_Civil  Edad  Experiencia  Salario Gerencia  \
0   Alexandro  Masculino     Soltero(a)  22.0          3.0   2423.0       No
1      Carlos  Masculino      Casado(a)  38.0         10.0   3132.0       Sí
2      Felipa   Femenino     Soltero(a)  26.0          5.0   2639.0       No
3      Daniel  Masculino      Casado(a)  35.0         10.0   3122.0       No
4        John  Masculino      Casado(a)  35.0         13.0   3431.0       Sí
5      Edward  Masculino     Soltero(a)   NaN          NaN   4500.0       No
6     Ruperta   Femenino      Casado(a)  54.0         18.0   3962.0       No
7       Amaya   Femenino  Divorciado(a)  22.0          3.0   2450.0      NaN
8   Francisca   Femenino     Soltero(a)  27.0          4.0   2564.0       No
9      Selena   Femenino      Casado(a)  24.0          6.0   2709.0       Sí
10       Febe   Femenino      Casado(a)  44.0         22.0   4359.0       No
11     Ximena   Femenino     Soltero(a)  58.0         24.0   4532.0       No
12      David  Masculino  Divorciado(a)  20.0          1.0   1977.0       No
13        Max  Masculino  Divorciado(a)  39.0          8.0   2953.0       No
14     Selena   Femenino      Casado(a)  24.0          6.0   2709.0       Sí
15        NaN   Femenino            NaN  44.0         22.0      NaN      NaN
16      Paula   Femenino  Divorciado(a)  55.0         12.0   3306.0       No
17        Tim  Masculino  Divorciado(a)  22.0          4.0   2518.0       No
18     Andrew  Masculino  Divorciado(a)   NaN         10.0   3194.0       No
19     Gloria   Femenino      Casado(a)  31.0         11.0   3267.0       No

            Departamento
0             Publicidad
1                    NaN
2              Comercial
3              Comercial
4   Servicios al cliente
5                  Legal
6               Producto
7              Comercial
8                     IT
9           Contabilidad
10                   NaN
11                 Legal
12      Recursos Humanos
13                Ventas
14          Contabilidad
15                   NaN
16              Producto
17      Recursos Humanos
18              Producto
19  Servicios al cliente

In [4]:
print(df.shape)

(251, 8)

## Show rows that have at least 1 missing value

In [6]:
print(df[df.isnull().any(axis=1)])

     Nombre       Sexo   Estado_Civil  Edad  Experiencia  Salario Gerencia  \
1    Carlos  Masculino      Casado(a)  38.0         10.0   3132.0       Sí
5    Edward  Masculino     Soltero(a)   NaN          NaN   4500.0       No
7     Amaya   Femenino  Divorciado(a)  22.0          3.0   2450.0      NaN
10     Febe   Femenino      Casado(a)  44.0         22.0   4359.0       No
15      NaN   Femenino            NaN  44.0         22.0      NaN      NaN
..      ...        ...            ...   ...          ...      ...      ...
241  Robert        NaN     Soltero(a)  33.0         11.0   3267.0       No
242   Kevin        NaN  Divorciado(a)   NaN         20.0   4166.0       No
243   Amaro  Masculino      Casado(a)   NaN         24.0   4510.0       No
248    Eric        NaN      Casado(a)  25.0          7.0   2880.0       Sí
249    Marc        NaN      Casado(a)  24.0          2.0   2172.0       No

         Departamento
1                 NaN
5               Legal
7           Comercial
10                NaN
15                NaN
..                ...
241  Recursos Humanos
242          Finanzas
243         Comercial
248  Recursos Humanos
249          Producto

[106 rows x 8 columns]

## Delete rows with missing values

In [7]:
new_df = df.dropna(axis=0)
print(new_df)

        Nombre       Sexo   Estado_Civil  Edad  Experiencia  Salario Gerencia  \
0    Alexandro  Masculino     Soltero(a)  22.0          3.0   2423.0       No
2       Felipa   Femenino     Soltero(a)  26.0          5.0   2639.0       No
3       Daniel  Masculino      Casado(a)  35.0         10.0   3122.0       No
4         John  Masculino      Casado(a)  35.0         13.0   3431.0       Sí
6      Ruperta   Femenino      Casado(a)  54.0         18.0   3962.0       No
..         ...        ...            ...   ...          ...      ...      ...
244   Hernando  Masculino  Divorciado(a)  29.0          4.0   2510.0       No
245       Vito  Masculino  Divorciado(a)  22.0          4.0   2530.0       No
246       Jose  Masculino      Casado(a)  30.0          6.0   2760.0       No
247    Marcelo  Masculino  Divorciado(a)  44.0         15.0   3616.0       No
250    Leandro  Masculino      Casado(a)  37.0         11.0   3245.0       No

             Departamento
0              Publicidad
2               Comercial
3               Comercial
4    Servicios al cliente
6                Producto
..                    ...
244                    IT
245              Producto
246  Servicios al cliente
247                    IT
250              Finanzas

[145 rows x 8 columns]

## Delete rows that don't have at least 5 values

In [8]:
valid_df = df.dropna(thresh=5)
print(valid_df)

        Nombre       Sexo   Estado_Civil  Edad  Experiencia  Salario Gerencia  \
0    Alexandro  Masculino     Soltero(a)  22.0          3.0   2423.0       No
1       Carlos  Masculino      Casado(a)  38.0         10.0   3132.0       Sí
2       Felipa   Femenino     Soltero(a)  26.0          5.0   2639.0       No
3       Daniel  Masculino      Casado(a)  35.0         10.0   3122.0       No
4         John  Masculino      Casado(a)  35.0         13.0   3431.0       Sí
..         ...        ...            ...   ...          ...      ...      ...
246       Jose  Masculino      Casado(a)  30.0          6.0   2760.0       No
247    Marcelo  Masculino  Divorciado(a)  44.0         15.0   3616.0       No
248       Eric        NaN      Casado(a)  25.0          7.0   2880.0       Sí
249       Marc        NaN      Casado(a)  24.0          2.0   2172.0       No
250    Leandro  Masculino      Casado(a)  37.0         11.0   3245.0       No

             Departamento
0              Publicidad
1                     NaN
2               Comercial
3               Comercial
4    Servicios al cliente
..                    ...
246  Servicios al cliente
247                    IT
248      Recursos Humanos
249              Producto
250              Finanzas

[246 rows x 8 columns]